### Q1. How do you load a CSV file into a Pandas DataFrame?

In [1]:

import pandas as pd
df=pd.read_csv("organizations.csv")
print(df)

   Index  Organization Id            Name  Number of employees  years
0      1  FAB0d41d5b5d22c         Ferrell                 3498      2
1      2  6A7EdDEA9FaDC52        Mckinney                 4952      4
2      3  0bFED1ADAE4bcC1          Hester                 5287      5
3      4  2bFC1Be8a4ce42f  Holder-Sellers                  921      6
4      5  9eE8A6a4Eb96C24     Mayer Group                 7870     10
5      6  cC757116fe1C085  Henry-Thompson                 4914      5
6      7  219233e8aFF1BC3  Hansen-Everett                 7832      5
7      8  ccc93DCF81a31CD   Mcintosh-Mora                 4389      4
8      9  0B4F93aA06ED03e        Carr Inc                 8167      8
9     10  738b5aDe6B1C6A5      Gaines Inc                 9698     10

Q2. How do you check the data type of a column in a Pandas DataFrame?

In [2]:
df['Number of employees'].dtypes

dtype('int64')

In [3]:
df.dtypes

Index                   int64
Organization Id        object
Name                   object
Number of employees     int64
years                   int64
dtype: object

Q3. How do you select rows from a Pandas DataFrame based on a condition?

In [4]:
#BMI>33
res=df.loc[df['Number of employees']>4389]
print(res)

   Index  Organization Id            Name  Number of employees  years
1      2  6A7EdDEA9FaDC52        Mckinney                 4952      4
2      3  0bFED1ADAE4bcC1          Hester                 5287      5
4      5  9eE8A6a4Eb96C24     Mayer Group                 7870     10
5      6  cC757116fe1C085  Henry-Thompson                 4914      5
6      7  219233e8aFF1BC3  Hansen-Everett                 7832      5
8      9  0B4F93aA06ED03e        Carr Inc                 8167      8
9     10  738b5aDe6B1C6A5      Gaines Inc                 9698     10

Q4. How do you rename columns in a Pandas DataFrame?

In [5]:
df.rename(columns = {'Name':'FullName','Number of employees':'Total Employees'}, inplace = True)
   
df

   Index  Organization Id        FullName  Total Employees  years
0      1  FAB0d41d5b5d22c         Ferrell             3498      2
1      2  6A7EdDEA9FaDC52        Mckinney             4952      4
2      3  0bFED1ADAE4bcC1          Hester             5287      5
3      4  2bFC1Be8a4ce42f  Holder-Sellers              921      6
4      5  9eE8A6a4Eb96C24     Mayer Group             7870     10
5      6  cC757116fe1C085  Henry-Thompson             4914      5
6      7  219233e8aFF1BC3  Hansen-Everett             7832      5
7      8  ccc93DCF81a31CD   Mcintosh-Mora             4389      4
8      9  0B4F93aA06ED03e        Carr Inc             8167      8
9     10  738b5aDe6B1C6A5      Gaines Inc             9698     10

In [6]:
df.rename(columns = {'Name':'FullName','Number of employees':'Total Employees'}, inplace = True)
df

   Index  Organization Id        FullName  Total Employees  years
0      1  FAB0d41d5b5d22c         Ferrell             3498      2
1      2  6A7EdDEA9FaDC52        Mckinney             4952      4
2      3  0bFED1ADAE4bcC1          Hester             5287      5
3      4  2bFC1Be8a4ce42f  Holder-Sellers              921      6
4      5  9eE8A6a4Eb96C24     Mayer Group             7870     10
5      6  cC757116fe1C085  Henry-Thompson             4914      5
6      7  219233e8aFF1BC3  Hansen-Everett             7832      5
7      8  ccc93DCF81a31CD   Mcintosh-Mora             4389      4
8      9  0B4F93aA06ED03e        Carr Inc             8167      8
9     10  738b5aDe6B1C6A5      Gaines Inc             9698     10

Q5. How do you drop columns in a Pandas DataFrame?

In [7]:
df.drop(['Total Employees'], axis=1)

   Index  Organization Id        FullName  years
0      1  FAB0d41d5b5d22c         Ferrell      2
1      2  6A7EdDEA9FaDC52        Mckinney      4
2      3  0bFED1ADAE4bcC1          Hester      5
3      4  2bFC1Be8a4ce42f  Holder-Sellers      6
4      5  9eE8A6a4Eb96C24     Mayer Group     10
5      6  cC757116fe1C085  Henry-Thompson      5
6      7  219233e8aFF1BC3  Hansen-Everett      5
7      8  ccc93DCF81a31CD   Mcintosh-Mora      4
8      9  0B4F93aA06ED03e        Carr Inc      8
9     10  738b5aDe6B1C6A5      Gaines Inc     10

Q6. How do you find the unique values in a column of a Pandas DataFrame?

In [8]:
df['FullName'].unique()

array(['Ferrell', 'Mckinney', 'Hester', 'Holder-Sellers', 'Mayer Group',
       'Henry-Thompson', 'Hansen-Everett', 'Mcintosh-Mora', 'Carr Inc',
       'Gaines Inc'], dtype=object)

Q7. How do you find the number of missing values in each column of a Pandas DataFrame?

In [9]:
df.isnull().sum()

Index              0
Organization Id    0
FullName           0
Total Employees    0
years              0
dtype: int64

Q8. How do you fill missing values in a Pandas DataFrame with a specific value?

Q8. How do you fill missing values in a Pandas DataFrame with a specific value?

In [10]:
newdf = df.fillna(2)
newdf

   Index  Organization Id        FullName  Total Employees  years
0      1  FAB0d41d5b5d22c         Ferrell             3498      2
1      2  6A7EdDEA9FaDC52        Mckinney             4952      4
2      3  0bFED1ADAE4bcC1          Hester             5287      5
3      4  2bFC1Be8a4ce42f  Holder-Sellers              921      6
4      5  9eE8A6a4Eb96C24     Mayer Group             7870     10
5      6  cC757116fe1C085  Henry-Thompson             4914      5
6      7  219233e8aFF1BC3  Hansen-Everett             7832      5
7      8  ccc93DCF81a31CD   Mcintosh-Mora             4389      4
8      9  0B4F93aA06ED03e        Carr Inc             8167      8
9     10  738b5aDe6B1C6A5      Gaines Inc             9698     10

Q9. How do you concatenate two Pandas DataFrames?

In [11]:
list1=[[1,2,3,4,5],[6,7,8,9,10]]
df1=pd.DataFrame(data=list1,columns="a b c d e".split())
list2=[[11,12,13,14,15],[16,17,18,9,20]]
df2=pd.DataFrame(data=list2,columns="a b c d e".split())

In [12]:
pd.concat([df1,df2])

    a   b   c   d   e
0   1   2   3   4   5
1   6   7   8   9  10
0  11  12  13  14  15
1  16  17  18   9  20

Q10. How do you merge two Pandas DataFrames on a specific column?

In [13]:
list1=[[1,2,3,4,5],[6,7,8,9,10]]
df1=pd.DataFrame(data=list1,columns="a b c d e".split())
df1

   a  b  c  d   e
0  1  2  3  4   5
1  6  7  8  9  10

In [14]:
list2=[[1,12,13],[6,17,18]]
df2=pd.DataFrame(data=list2,columns="a f g".split())
df2

   a   f   g
0  1  12  13
1  6  17  18

In [15]:
df1.merge(df2[['a','f', 'g']])

   a  b  c  d   e   f   g
0  1  2  3  4   5  12  13
1  6  7  8  9  10  17  18

Q11. How do you group data in a Pandas DataFrame by a specific column and apply an aggregation function?

In [16]:
df3 = pd.DataFrame({'Name':['Raju', 'Divya', 'Geeta', 'Sita',"Rosan"],
                    'Grade':['A', 'A', 'B', 'A','B'],
                    'Rank':[3, 1, 4, 2,5 ],
                    'Gender':['Male', 'Female', 'Female', 'Female','male'],
                     'no':['0','1','2','3','4']})
df3.groupby(['Rank']).sum()

       Name Grade  Gender no
Rank
1     Divya     A  Female  1
2      Sita     A  Female  3
3      Raju     A    Male  0
4     Geeta     B  Female  2
5     Rosan     B    male  4

Q12. How do you pivot a Pandas DataFrame?

In [17]:
df = pd.DataFrame({'A': ['John', 'Boby', 'Mina'],
      'B': ['Masters', 'Graduate', 'Graduate'],
      'C': [27, 23, 21]})

df

      A         B   C
0  John   Masters  27
1  Boby  Graduate  23
2  Mina  Graduate  21

In [18]:
df.pivot(index='A',columns='B',values='C')

B     Graduate  Masters
A
Boby      23.0      NaN
John       NaN     27.0
Mina      21.0      NaN

Q13. How do you change the data type of a column in a Pandas DataFrame?

In [19]:
df = pd.DataFrame({
    'A': [1, 2, 3],
    'B': ['a', 'b', 'c'],
    'C': [1.1, '1.0', '1.3']})
df.dtypes

A     int64
B    object
C    object
dtype: object

In [20]:
df=df.astype(str)
df.dtypes

A    object
B    object
C    object
dtype: object

Q14. How do you sort a Pandas DataFrame by a specific column?

In [21]:
df3 = pd.DataFrame({'Name':['Raju', 'Divya', 'Geeta', 'Sita',"Rosan"],
                    'Grade':['A', 'A', 'B', 'A','B'],
                    'Rank':[3, 1, 4, 2,5 ],
                    'Gender':['Male', 'Female', 'Female', 'Female','male'],
                     'no':['4','0','2','1','3']})
sorted_df = df3.sort_values(by=['no'], ascending=True)

In [22]:
sorted_df

    Name Grade  Rank  Gender no
1  Divya     A     1  Female  0
3   Sita     A     2  Female  1
2  Geeta     B     4  Female  2
4  Rosan     B     5    male  3
0   Raju     A     3    Male  4

Q15. How do you create a copy of a Pandas DataFrame?

In [23]:
new_df=df3.copy()
new_df

    Name Grade  Rank  Gender no
0   Raju     A     3    Male  4
1  Divya     A     1  Female  0
2  Geeta     B     4  Female  2
3   Sita     A     2  Female  1
4  Rosan     B     5    male  3

Q16. How do you filter rows of a Pandas DataFrame by multiple conditions?

In [24]:
new_df.loc[(new_df['Grade']=='A')&(new_df['Name'].str.startswith('R'))]

   Name Grade  Rank Gender no
0  Raju     A     3   Male  4

Q17. How do you calculate the mean of a column in a Pandas DataFrame?

In [25]:
df3 = pd.DataFrame({'Name':['Raju', 'Divya', 'Geeta', 'Sita',"Rosan"],
                    'Grade':['A', 'A', 'B', 'A','B'],
                    'Rank':[3, 1, 4, 2,5 ],
                    'Gender':['Male', 'Female', 'Female', 'Female','male'],
                     'no':['4','0','2','1','3']})
new_df = df3["Rank"].mean()
new_df

3.0

Q18. How do you calculate the standard deviation of a column in a Pandas DataFrame?

In [26]:
df3.Rank.std()

1.5811388300841898

Q19. How do you calculate the correlation between two columns in a Pandas DataFrame?

In [27]:
df

   A  B    C
0  1  a  1.1
1  2  b  1.0
2  3  c  1.3

Q20. How do you select specific columns in a DataFrame using their labels?

In [28]:
df

   A  B    C
0  1  a  1.1
1  2  b  1.0
2  3  c  1.3

In [29]:
print(df['A'])

0    1
1    2
2    3
Name: A, dtype: object

Q21. How do you select specific rows in a DataFrame using their indexes?

In [30]:
df

   A  B    C
0  1  a  1.1
1  2  b  1.0
2  3  c  1.3

In [31]:
df.loc[[2]]

   A  B    C
2  3  c  1.3

In [32]:
df.iloc[1:4,3:5]

Empty DataFrame
Columns: []
Index: [1, 2]

Q22. How do you sort a DataFrame by a specific column?

In [33]:
df.sort_values('B')

   A  B    C
0  1  a  1.1
1  2  b  1.0
2  3  c  1.3

Q23. How do you create a new column in a DataFrame based on the values of another column?

In [34]:
df3

    Name Grade  Rank  Gender no
0   Raju     A     3    Male  4
1  Divya     A     1  Female  0
2  Geeta     B     4  Female  2
3   Sita     A     2  Female  1
4  Rosan     B     5    male  3

In [35]:
states="Delhi Mumbai Punjab Jharkhand Odisha".split()
df3['States']=states

In [36]:
df3

    Name Grade  Rank  Gender no     States
0   Raju     A     3    Male  4      Delhi
1  Divya     A     1  Female  0     Mumbai
2  Geeta     B     4  Female  2     Punjab
3   Sita     A     2  Female  1  Jharkhand
4  Rosan     B     5    male  3     Odisha

Q24. How do you remove duplicates from a DataFrame?

In [37]:
df3 = pd.DataFrame({'Name':['Raju', 'Divya', 'Geeta', 'Sita',"Raju"],
                    'Grade':['A', 'A', 'B', 'A','A'],
                    'Rank':[3, 1, 4, 2,3 ],
                    'Gender':['Male', 'Female', 'Female', 'Female','Male'],
                     'no':['4','0','2','1','4']})

In [38]:
df3

    Name Grade  Rank  Gender no
0   Raju     A     3    Male  4
1  Divya     A     1  Female  0
2  Geeta     B     4  Female  2
3   Sita     A     2  Female  1
4   Raju     A     3    Male  4

In [39]:
df3.drop_duplicates(inplace=True)

In [40]:
df3

    Name Grade  Rank  Gender no
0   Raju     A     3    Male  4
1  Divya     A     1  Female  0
2  Geeta     B     4  Female  2
3   Sita     A     2  Female  1

Q25. What is the difference between .loc and .iloc in Pandas?

Loc-is used for fetching a particular row or set of rows using range from a data farme.
iloc-is used for fetching a particular row/Column or rows and column  or set of rows or set of columns or set of rows and set of columnsfrom a data farme.

In [41]:
print(df3.loc[0])
print(df3.loc[0:4])
print(df3.loc[[0,1]])

Name      Raju
Grade        A
Rank         3
Gender    Male
no           4
Name: 0, dtype: object
    Name Grade  Rank  Gender no
0   Raju     A     3    Male  4
1  Divya     A     1  Female  0
2  Geeta     B     4  Female  2
3   Sita     A     2  Female  1
    Name Grade  Rank  Gender no
0   Raju     A     3    Male  4
1  Divya     A     1  Female  0

In [42]:
print(df3.iloc[[0,1,2]])
print(df3.iloc[0:2,2:4])

    Name Grade  Rank  Gender no
0   Raju     A     3    Male  4
1  Divya     A     1  Female  0
2  Geeta     B     4  Female  2
   Rank  Gender
0     3    Male
1     1  Female